from book import Book
from person import Person
from takenBook import *

class Base_DB():
    per1 = Person("13.01.2024","Павел Павлович Павелов",22211,["1984"])
    per2 = Person("12.02.2023","Дмитрий Дмитриевич Дмитров",22111,[])
    per3 = Person("02.06.2023","Александр Александрович Александров",21111,[])
    book1 = Book("1984","Джордж Оруэлл", "111111", "12.12.2022", "Москва", "ACT", 12, 11)
    book2 = Book("Руслан и Людмила","Александр Сергеевич Пушкин", "211111", "11.12.2022", "Москва", "AT", 9, 9)
    tBook1 = takenBook("1984", "Павел Павлович Павелов", "11.02.2024", "11.03.2024", "Нет")
    
    person_arr = [per1, per2, per3]
    book_arr = [book1, book2] 
  
        
    
